In [1]:
# pandas의 데이터 구조 - series, dataFrame

In [2]:
import pandas as pd

In [3]:
s = pd.Series(['banana',42])

In [4]:
s

0    banana
1        42
dtype: object

In [5]:
pd.Series(['Wes McKinney','Creator of pandas'],index=['Person','Who'])

Person         Wes McKinney
Who       Creator of pandas
dtype: object

In [7]:
scientists =  pd.DataFrame({
    'Name' : ['Rosalind Franklin', 'William Gosset'],
    'Occupation' : ['Chemist','Statistician'],
    'Born' : ['1920-07-25', '1876-06-13'],
    'Died' : ['1958-04-16', '1937-10-16'],
    'Age' : [37, 61]
})

In [8]:
scientists

                Name    Occupation        Born        Died  Age
0  Rosalind Franklin       Chemist  1920-07-25  1958-04-16   37
1     William Gosset  Statistician  1876-06-13  1937-10-16   61

In [9]:
scientists.index

RangeIndex(start=0, stop=2, step=1)

In [10]:
scientists.columns

Index(['Name', 'Occupation', 'Born', 'Died', 'Age'], dtype='object')

In [11]:
scientists.values

array([['Rosalind Franklin', 'Chemist', '1920-07-25', '1958-04-16', 37],
       ['William Gosset', 'Statistician', '1876-06-13', '1937-10-16', 61]],
      dtype=object)

In [12]:
scientists.keys()

Index(['Name', 'Occupation', 'Born', 'Died', 'Age'], dtype='object')

In [14]:
scientists.value_counts('Age')

Age
37    1
61    1
dtype: int64

In [15]:
scientists.Age.mean()

49.0

In [16]:
scientists['Age'].mean()

49.0

In [17]:
scientists['Age'].min()

37

In [18]:
scientists['Age'].max()

61

In [19]:
scientists['Age'].var()

288.0

In [20]:
scientists['Age'].std()

16.97056274847714

In [21]:
scientists['Age'].sum()

98

In [23]:
scientists = pd.read_csv('data/scientists.csv')

In [24]:
scientists.columns

Index(['Name', 'Born', 'Died', 'Age', 'Occupation'], dtype='object')

In [27]:
ages = scientists['Age']

In [28]:
ages.mean()

59.125

In [31]:
ages[ages > ages.mean()]

1    61
2    90
3    66
7    77
Name: Age, dtype: int64

In [32]:
scientists[scientists['Age']>scientists['Age'].mean()]

                   Name        Born        Died  Age     Occupation
1        William Gosset  1876-06-13  1937-10-16   61   Statistician
2  Florence Nightingale  1820-05-12  1910-08-13   90          Nurse
3           Marie Curie  1867-11-07  1934-07-04   66        Chemist
7          Johann Gauss  1777-04-30  1855-02-23   77  Mathematician

In [33]:
ages + ages

0     74
1    122
2    180
3    132
4    112
5     90
6     82
7    154
Name: Age, dtype: int64

In [34]:
# 스칼라 값이 broadcasting됨
# 모두 100씩 더해짐
ages + 100

0    137
1    161
2    190
3    166
4    156
5    145
6    141
7    177
Name: Age, dtype: int64

In [35]:
ages + pd.Series([1,100])

0     38.0
1    161.0
2      NaN
3      NaN
4      NaN
5      NaN
6      NaN
7      NaN
dtype: float64

In [36]:
scientists.sort_index(ascending=False)

                   Name        Born        Died  Age          Occupation
7          Johann Gauss  1777-04-30  1855-02-23   77       Mathematician
6           Alan Turing  1912-06-23  1954-06-07   41  Computer Scientist
5             John Snow  1813-03-15  1858-06-16   45           Physician
4         Rachel Carson  1907-05-27  1964-04-14   56           Biologist
3           Marie Curie  1867-11-07  1934-07-04   66             Chemist
2  Florence Nightingale  1820-05-12  1910-08-13   90               Nurse
1        William Gosset  1876-06-13  1937-10-16   61        Statistician
0     Rosaline Franklin  1920-07-25  1958-04-16   37             Chemist

In [37]:
scientists.sort_values('Age')

                   Name        Born        Died  Age          Occupation
0     Rosaline Franklin  1920-07-25  1958-04-16   37             Chemist
6           Alan Turing  1912-06-23  1954-06-07   41  Computer Scientist
5             John Snow  1813-03-15  1858-06-16   45           Physician
4         Rachel Carson  1907-05-27  1964-04-14   56           Biologist
1        William Gosset  1876-06-13  1937-10-16   61        Statistician
3           Marie Curie  1867-11-07  1934-07-04   66             Chemist
7          Johann Gauss  1777-04-30  1855-02-23   77       Mathematician
2  Florence Nightingale  1820-05-12  1910-08-13   90               Nurse

In [38]:
print(scientists['Born'].dtype)

object

In [39]:
pd.to_datetime(scientists['Born'])

0   1920-07-25
1   1876-06-13
2   1820-05-12
3   1867-11-07
4   1907-05-27
5   1813-03-15
6   1912-06-23
7   1777-04-30
Name: Born, dtype: datetime64[ns]

In [40]:
pd.to_datetime('2000년 3월 7일', format='%Y년 %m월 %d일')

Timestamp('2000-03-07 00:00:00')

In [44]:
scientists['Born'] = pd.to_datetime(scientists['Born'])

In [45]:
scientists['Died'] = pd.to_datetime(scientists['Died'])

In [46]:
scientists['age_days_dt'] = scientists['Died'] - scientists['Born']

In [50]:
scientists

,Name,Born,Died,Age,Occupation,age_days_dt
0,Rosaline Franklin,1920-07-25,1958-04-16,37,Chemist,13779 days
1,William Gosset,1876-06-13,1937-10-16,61,Statistician,22404 days
2,Florence Nightingale,1820-05-12,1910-08-13,90,Nurse,32964 days
3,Marie Curie,1867-11-07,1934-07-04,66,Chemist,24345 days
4,Rachel Carson,1907-05-27,1964-04-14,56,Biologist,20777 days
5,John Snow,1813-03-15,1858-06-16,45,Physician,16529 days
6,Alan Turing,1912-06-23,1954-06-07,41,Computer Scientist,15324 days
7,Johann Gauss,1777-04-30,1855-02-23,77,Mathematician,28422 days

In [51]:
# 열 삭제

In [54]:
scientists.drop(columns='age_days_dt', inplace=True)

In [55]:
scientists

                   Name       Born       Died  Age          Occupation
0     Rosaline Franklin 1920-07-25 1958-04-16   37             Chemist
1        William Gosset 1876-06-13 1937-10-16   61        Statistician
2  Florence Nightingale 1820-05-12 1910-08-13   90               Nurse
3           Marie Curie 1867-11-07 1934-07-04   66             Chemist
4         Rachel Carson 1907-05-27 1964-04-14   56           Biologist
5             John Snow 1813-03-15 1858-06-16   45           Physician
6           Alan Turing 1912-06-23 1954-06-07   41  Computer Scientist
7          Johann Gauss 1777-04-30 1855-02-23   77       Mathematician

In [56]:
scientists.drop(index=[2,5])

                Name       Born       Died  Age          Occupation
0  Rosaline Franklin 1920-07-25 1958-04-16   37             Chemist
1     William Gosset 1876-06-13 1937-10-16   61        Statistician
3        Marie Curie 1867-11-07 1934-07-04   66             Chemist
4      Rachel Carson 1907-05-27 1964-04-14   56           Biologist
6        Alan Turing 1912-06-23 1954-06-07   41  Computer Scientist
7       Johann Gauss 1777-04-30 1855-02-23   77       Mathematician

In [57]:
scientists.to_pickle('test.pickle')

In [59]:
ss = pd.read_pickle('test.pickle')

In [60]:
ss

                   Name       Born       Died  Age          Occupation
0     Rosaline Franklin 1920-07-25 1958-04-16   37             Chemist
1        William Gosset 1876-06-13 1937-10-16   61        Statistician
2  Florence Nightingale 1820-05-12 1910-08-13   90               Nurse
3           Marie Curie 1867-11-07 1934-07-04   66             Chemist
4         Rachel Carson 1907-05-27 1964-04-14   56           Biologist
5             John Snow 1813-03-15 1858-06-16   45           Physician
6           Alan Turing 1912-06-23 1954-06-07   41  Computer Scientist
7          Johann Gauss 1777-04-30 1855-02-23   77       Mathematician

In [64]:
scientists.to_csv('test1.csv',sep='\t')